In [40]:
import pandas as pd
data = {"id":[1,2,3,4,5,1,7],
    "name":["charan","srinu","vasu","chandhu","manoj","charan","karthik"],
    "marks":[90,98,97,90,99,90,87]
}
df = pd.DataFrame(data)
df

   id     name  marks
0   1   charan     90
1   2    srinu     98
2   3     vasu     97
3   4  chandhu     90
4   5    manoj     99
5   1   charan     90
6   7  karthik     87

In [41]:
df = pd.read_csv("/Users/vikasy/Downloads/salary.csv")
df.head()
df.size

488415

In [ ]:
df.drop(columns = "relationship",inplace = True)
print(df.columns.tolist())

['age', 'workclass', 'fnlwgt', 'education', 'education-num', 'marital-status', 'occupation', 'race', 'sex', 'capital-gain', 'capital-loss', 'hours-per-week', 'native-country', 'salary']

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   fnlwgt          32561 non-null  int64
 3   education       32561 non-null  object
 4   education-num   32561 non-null  int64
 5   marital-status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   race            32561 non-null  object
 8   sex             32561 non-null  object
 9   capital-gain    32561 non-null  int64
 10  capital-loss    32561 non-null  int64
 11  hours-per-week  32561 non-null  int64
 12  native-country  32561 non-null  object
 13  salary          32561 non-null  object
dtypes: int64(6), object(8)
memory usage: 3.5+ MB

In [37]:
df.duplicated().any()
df[df.duplicated()]
df.duplicated(subset= "age").count()

32561